; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v10 ?v5)
             (pred_6 ?v3 ?v11)
             (pred_11 ?v10 ?v11)
             (pred_12 ?v6 ?v10 )
	     (pred_8 ?v10)
             (pred_5 ?v12)
             (pred_10 ?v3)
             (pred_3 ?v11)
             (pred_2 ?v10)
             (pred_7 ?v3)
             (pred_4 ?v10)
             (pred_1 ))



(:action op_5
:parameters (?v2 ?v7 ?v9 ?v4)
:precondition (and (pred_5 ?v2) (pred_5 ?v7) (pred_10 ?v9) (pred_3 ?v4)
          (pred_9 ?v2 ?v7) (pred_6 ?v9 ?v4)
                   (pred_11 ?v7 ?v4) (pred_8 ?v2) 
                   (pred_2 ?v7) (pred_7 ?v9))
:effect (and  (pred_4 ?v7) (not (pred_2 ?v7))))


(:action op_1
:parameters (?v2 ?v1)
:precondition (and (pred_5 ?v2) (pred_5 ?v1)
               (pred_8 ?v2) (pred_9 ?v2 ?v1) (pred_4 ?v1))
:effect (and (pred_8 ?v1) (not (pred_8 ?v2))))

(:action op_4
:parameters (?v2 ?v9)
:precondition (and (pred_5 ?v2) (pred_10 ?v9) 
                  (pred_8 ?v2) (pred_12 ?v9 ?v2) (pred_1 ))
:effect (and (pred_7 ?v9)
   (not (pred_12 ?v9 ?v2)) (not (pred_1 ))))


(:action op_2
:parameters (?v2 ?v13 ?v8)
:precondition (and (pred_5 ?v2) (pred_10 ?v13) (pred_10 ?v8)
                  (pred_8 ?v2) (pred_7 ?v8) (pred_12 ?v13 ?v2))
:effect (and (pred_7 ?v13) (pred_12 ?v8 ?v2)
        (not (pred_7 ?v8)) (not (pred_12 ?v13 ?v2))))

(:action op_3
:parameters (?v2 ?v9)
:precondition (and (pred_5 ?v2) (pred_10 ?v9) 
                  (pred_8 ?v2) (pred_7 ?v9))
:effect (and (pred_1 ) (pred_12 ?v9 ?v2) (not (pred_7 ?v9)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_07 obj_05 obj_06 obj_02 obj_09 obj_03 obj_01 obj_10 obj_12
    obj_08 obj_13
    obj_11 obj_04
    )

    (:init
       (pred_1)

       (pred_5 obj_07)
       (pred_5 obj_05)
       (pred_5 obj_06)
       (pred_5 obj_02)
       (pred_5 obj_09)
       (pred_5 obj_03)
       (pred_5 obj_01)
       (pred_5 obj_10)
       (pred_5 obj_12)
       (pred_3 obj_08)
       (pred_3 obj_13)
       (pred_10 obj_11)
       (pred_10 obj_04)

       (pred_9 obj_07 obj_02)
       (pred_9 obj_07 obj_05)
       (pred_9 obj_05 obj_09)
       (pred_9 obj_05 obj_06)
       (pred_9 obj_05 obj_07)
       (pred_9 obj_06 obj_03)
       (pred_9 obj_06 obj_05)
       (pred_9 obj_02 obj_01)
       (pred_9 obj_02 obj_09)
       (pred_9 obj_02 obj_07)
       (pred_9 obj_09 obj_10)
       (pred_9 obj_09 obj_03)
       (pred_9 obj_09 obj_05)
       (pred_9 obj_09 obj_02)
       (pred_9 obj_03 obj_12)
       (pred_9 obj_03 obj_06)
       (pred_9 obj_03 obj_09)
       (pred_9 obj_01 obj_10)
       (pred_9 obj_01 obj_02)
       (pred_9 obj_10 obj_12)
       (pred_9 obj_10 obj_09)
       (pred_9 obj_10 obj_01)
       (pred_9 obj_12 obj_03)
       (pred_9 obj_12 obj_10)
       (pred_2 obj_06)
       (pred_2 obj_09)
       (pred_11  obj_06 obj_08)
       (pred_11  obj_09 obj_13)
       (pred_4 obj_07)
       (pred_4 obj_05)
       (pred_4 obj_02)
       (pred_4 obj_03)
       (pred_4 obj_01)
       (pred_4 obj_10)
       (pred_4 obj_12)

       (pred_6  obj_11 obj_08)
       (pred_6  obj_04 obj_13)
       (pred_12 obj_11 obj_05)
       (pred_12 obj_04 obj_07)
       (pred_8 obj_12)
    )

    (:goal (and
       (pred_12 obj_11 obj_12)
       (pred_12 obj_04 obj_10)
    ))
(:constraints
  (always (not (pred_8 obj_09)))
)
)

; plan
1. (op_1 obj_12 obj_10)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_10)
   goals met: 0 of 2
2. (op_1 obj_10 obj_01)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_01)
   goals met: 0 of 2
3. (op_1 obj_01 obj_02)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_02)
   goals met: 0 of 2
4. (op_1 obj_02 obj_07)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_07)
   goals met: 0 of 2
5. (op_4 obj_07 obj_04)
   deleted: (pred_12 obj_04 obj_07) (pred_1)
   added: (pred_7 obj_04)
   goals met: 0 of 2
6. (op_1 obj_07 obj_05)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_05)
   goals met: 0 of 2
7. (op_5 obj_05 obj_09 obj_04 obj_13)
   deleted: (pred_2 obj_09)
   added: (pred_4 obj_09)
   goals met: 0 of 2
8. (op_2 obj_05 obj_11 obj_04)
   deleted: (pred_7 obj_04) (pred_12 obj_11 obj_05)
   added: (pred_7 obj_11) (pred_12 obj_04 obj_05)
   goals met: 0 of 2
9. (op_5 obj_05 obj_06 obj_11 obj_08)
   deleted: (pred_2 obj_06)
   added: (pred_4 obj_06)
   goals met: 0 of 2
10. (op_1 obj_05 obj_06)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_06)
   goals met: 0 of 2
11. (op_1 obj_06 obj_03)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_03)
   goals met: 0 of 2
12. (op_1 obj_03 obj_12)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_12)
   goals met: 0 of 2
13. (op_3 obj_12 obj_11)
   deleted: (pred_7 obj_11)
   added: (pred_1) (pred_12 obj_11 obj_12)
   goals met: 1 of 2
14. (op_1 obj_12 obj_03)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_03)
   goals met: 1 of 2
15. (op_1 obj_03 obj_06)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_06)
   goals met: 1 of 2
16. (op_1 obj_06 obj_05)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_05)
   goals met: 1 of 2
17. (op_4 obj_05 obj_04)
   deleted: (pred_12 obj_04 obj_05) (pred_1)
   added: (pred_7 obj_04)
   goals met: 1 of 2
18. (op_1 obj_05 obj_07)
   deleted: (pred_8 obj_05)
   added: (pred_8 obj_07)
   goals met: 1 of 2
19. (op_1 obj_07 obj_02)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_02)
   goals met: 1 of 2
20. (op_1 obj_02 obj_01)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_01)
   goals met: 1 of 2
21. (op_1 obj_01 obj_10)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_10)
   goals met: 1 of 2
22. (op_3 obj_10 obj_04)
   deleted: (pred_7 obj_04)
   added: (pred_1) (pred_12 obj_04 obj_10)
   goals met: 2 of 2
